name:"runtime"
layer {
   name: "runtime"
   type: "Data"
   top: "data"
   top: "label"
   include {
      phase: TRAIN
   }

   data_param {
      source: "examples/runtime/db.train"
      batch_size: 100
      backend: LMDB
   }
}

layer {
   name: "runtime"
   type: "Data"
   top: "data"
   top: "label"
   include {
      phase: TEST
   }

   data_param {
      source: "examples/runtime/db.test"
      batch_size: 10
      backend: LMDB
   }
}

layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "data"
  top: "ip1"
  param {
    lr_mult: 1
    decay_mult: 250
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip1"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip1"
  bottom: "label"
  top: "loss"
}


